КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_НастройкиКонвертацииСправочников/КонтурЛогистика_НастройкиКонвертацииСправочников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_НастройкиКонвертацииСправочников</name>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыНастроекКонвертаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСправочникаИлиДокументаУС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСправочникаЛогистика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокументаОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитТитула</name>
    <comment>если не указан - для всех прикладных сущностей соответствующих указанному ТипСправочникаЛогистика</comment>
    <type>
      <types>EnumRef.КонтурЛогистика_РеквизитыТитуловДляНастроекКонвертацииСправочников</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьРеквизитыИзУчетнойСистемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеКонвертации</name>
    <type>
      <types>EnumRef.КонтурЛогистика_НаправлениеКонвертации</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьЭлементСправочникаУчетнойСистемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПравилаКонвертации</name>
    <attributes>
      <name>Картинка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитСправочникаЛогистика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитСправочникаЛогистикаПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитСправочникаЛогистикаТипЗначения</name>
      <comment>какого типа этот заполняемый реквизит</comment>
      <type>
        <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
        <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
        <types>EnumRef.КонтурЛогистика_ВидыКонтактнойИнформации</types>
        <types>Boolean</types>
        <types>EnumRef.КонтурЛогистика_ВидыВладенияТранспортнымСредством</types>
        <types>EnumRef.КонтурЛогистика_МетодыОпределенияМассы</types>
        <types>String</types>
        <types>CatalogRef.КонтурЛогистика_Договоры</types>
        <types>Date</types>
        <types>Number</types>
        <types>CatalogRef.КонтурЛогистика_ПунктыМаршрута</types>
        <types>CatalogRef.КонтурЛогистика_ПодразделенияДиадок</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитСправочникаЛогистикаКомментарий</name>
      <comment>для того чтобы разъяснить пользователю особенности этого реквизита</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособМаппинга</name>
      <type>
        <types>EnumRef.КонтурЛогистика_СпособыМаппингаПоля</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеВычисления</name>
      <comment>как вычислять. Для маппинга доп свойств - указывается как получить реквизит, чье доп свойство требуется вычислить</comment>
      <type>
        <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючДопСвойстваРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеВычисления2</name>
      <type>
        <types>EnumRef.КонтурЛогистика_ТипыЛогистическихДокументов</types>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособКонвертацииЗначения</name>
      <type>
        <types>EnumRef.КонтурЛогистика_СпособыКонвертации</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбновитьИзУчетнойСистемы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеВычисленияСтрокаНеогр</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КонвертироватьПоНастройке</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_НастройкиКонвертацииСправочников</types>
      </type>
    </attributes>
    <attributes>
      <name>СвойствоОбъекта</name>
      <comment>Код свойства объекта</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаСоответствий</name>
    <attributes>
      <name>РеквизитСправочникаЛогистика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИзвлеченноеЗначение</name>
      <type>
        <types>DefinedType.КонтурЛогистика_ВсеСправочникиУчетнойСистемы</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособМаппинга</name>
      <type>
        <types>EnumRef.КонтурЛогистика_СпособыМаппингаПоля</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеВычисления</name>
      <comment>как вычислять. Для маппинга доп свойств - указывается как получить реквизит, чье доп свойство требуется вычислить</comment>
      <type>
        <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПравилаОбратнойКонвертации</name>
    <attributes>
      <name>Картинка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитСправочникаЛогистика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитСправочникаЛогистикаПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитСправочникаЛогистикаТипЗначения</name>
      <comment>какого типа этот заполняемый реквизит</comment>
      <type>
        <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
        <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
        <types>EnumRef.КонтурЛогистика_ВидыКонтактнойИнформации</types>
        <types>Boolean</types>
        <types>EnumRef.КонтурЛогистика_ВидыВладенияТранспортнымСредством</types>
        <types>EnumRef.КонтурЛогистика_МетодыОпределенияМассы</types>
        <types>String</types>
        <types>CatalogRef.КонтурЛогистика_Договоры</types>
        <types>Date</types>
        <types>Number</types>
        <types>CatalogRef.КонтурЛогистика_ПунктыМаршрута</types>
        <types>CatalogRef.КонтурЛогистика_ПодразделенияДиадок</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитСправочникаЛогистикаКомментарий</name>
      <comment>для того чтобы разъяснить пользователю особенности этого реквизита</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособМаппинга</name>
      <type>
        <types>EnumRef.КонтурЛогистика_СпособыМаппингаПоля</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеВычисления</name>
      <comment>как вычислять. Для маппинга доп свойств - указывается как получить реквизит, чье доп свойство требуется вычислить</comment>
      <type>
        <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючДопСвойстваРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеВычисления2</name>
      <type>
        <types>EnumRef.КонтурЛогистика_ТипыЛогистическихДокументов</types>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособКонвертацииЗначения</name>
      <type>
        <types>EnumRef.КонтурЛогистика_СпособыКонвертации</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбновитьИзУчетнойСистемы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеВычисленияСтрокаНеогр</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КонвертироватьПоНастройке</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_НастройкиКонвертацииСправочников</types>
      </type>
    </attributes>
    <attributes>
      <name>СвойствоОбъекта</name>
      <comment>Код свойства объекта</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаполнениеСпрУчСист</name>
    <attributes>
      <name>ТипАлгоритма</name>
      <type>
        <types>EnumRef.КонтурЛогистика_АлгоритмыЗаполнения</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитТипЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособРасчета</name>
      <type>
        <types>EnumRef.КонтурЛогистика_СпособыРасчетаЗначениейДокУчСист</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеВычисления</name>
      <comment>как вычислять. Для маппинга доп свойств - указывается как получить реквизит, чье доп свойство требуется вычислить</comment>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеВычисленияТипЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеВычисленияСтрокаНеогр</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КонвертироватьПоНастройке</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_НастройкиКонвертацииСправочников</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеВычисленияУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбновитьИзДокУчСист</name>
      <comment>Обновлять значение реквизита, даже если оно уже заполнено</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючевоеПоле</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Скрыть</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СпособыКонвертации/КонтурЛогистика_СпособыКонвертации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СпособыКонвертации</name>
  <enumValues>
    <name>БезДопОбработки</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьВОрганизациюДиадок</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьВПунктМаршрута</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьВТранспортноеСредство</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьВСотрудника</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьВДоговор</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьВПодразделениеДиадок</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьВЛицензию</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьВГорючеСмазочныйМатериал</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьПоТаблицеСоответствий</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьМассивСтруктур</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_НастройкиКонвертацииСправочников/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ОпределяемыеТипыДляНастроекКонвертации() Экспорт 
	
	ОпределяемыеТипы = Новый Массив;
	
	ОпределяемыеТипы.Добавить("КонтурЛогистика_Договор");
	ОпределяемыеТипы.Добавить("КонтурЛогистика_Контрагент");
	ОпределяемыеТипы.Добавить("КонтурЛогистика_Организация");
	ОпределяемыеТипы.Добавить("КонтурЛогистика_ОрганизацияКонтрагент");
	ОпределяемыеТипы.Добавить("КонтурЛогистика_ОрганизацияКонтрагентПартнер");
	ОпределяемыеТипы.Добавить("КонтурЛогистика_Перевозчик");
	ОпределяемыеТипы.Добавить("КонтурЛогистика_Подразделение");
	ОпределяемыеТипы.Добавить("КонтурЛогистика_ПунктМаршрутаУчетнойСистемы");
	ОпределяемыеТипы.Добавить("КонтурЛогистика_ТранспортноеСредство");
	ОпределяемыеТипы.Добавить("КонтурЛогистика_ФизическиеЛица");
	
	Возврат ОпределяемыеТипы;
	
КонецФункции

Функция ИменаКонвертируемыхСправочниковЛогистика() Экспорт 
	
	Имена = Новый Массив;
	
	Имена.Добавить("КонтурЛогистика_ГорючеСмазочныеМатериалы");
	Имена.Добавить("КонтурЛогистика_Договоры");
	Имена.Добавить("КонтурЛогистика_Лицензии");
	Имена.Добавить("КонтурЛогистика_ОрганизацииДиадок");
	Имена.Добавить("КонтурЛогистика_ПодразделенияДиадок");
	Имена.Добавить("КонтурЛогистика_ПунктыМаршрута");
	Имена.Добавить("КонтурЛогистика_Сотрудники");
	Имена.Добавить("КонтурЛогистика_ТранспортныеСредства");
	
	Возврат Имена;
	
КонецФункции

Функция ОписаниеСтандартныхРеквизитовСправочника(ИмяСправочника) Экспорт
	
	Возврат КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьОписаниеРеквизитовСправочника(ИмяСправочника);
	
КонецФункции

Функция ПолучитьНастройкуДляПоля(ИмяПоля, ТипЗначения = Неопределено, ТипСправочникаЛогистика = Неопределено, ИмяРеквизита = Неопределено) Экспорт 
	
	Настройка = Новый Структура;
	
	Если ЗначениеЗаполнено(ТипЗначения) Тогда
		Настройка.Вставить(ИмяПоля + "ТипЗначения", 	ТипЗначения);
	Иначе
		
		Настройка.Вставить(ИмяПоля + "ТипЗначения", 	"");
				
		Если ЗначениеЗаполнено(ТипСправочникаЛогистика)
			И ЗначениеЗаполнено(ИмяРеквизита) Тогда
			
			МетаданныеСправочника = Метаданные.Справочники[ТипСправочникаЛогистика];
			Реквизит = МетаданныеСправочника.Реквизиты.Найти(ИмяРеквизита);
			Если Не Реквизит = Неопределено Тогда
				Настройка.Вставить(ИмяПоля + "ТипЗначения", Реквизит.Тип);
			ИначеЕсли ИмяРеквизита = "Код" Тогда
				Настройка.Вставить(ИмяПоля + "ТипЗначения", "Строка");
			КонецЕсли;
			
		КонецЕсли;
				
	КонецЕсли;
	
	Настройка.Вставить("СпособКонвертацииЗначения", ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыКонвертации.БезДопОбработки"));
	Настройка.Вставить("СпособМаппинга", 			ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыМаппингаПоля.НеЗаполнять"));
		
	Возврат Настройка;
	
КонецФункции

Функция ПредставлениеПоИмениРеквизитаОбъектаМетеданных(ИмяОбъектаМетаданных, ИмяРеквизита)
	
	Коллекции = Новый Массив;
	
	// он стандартный?
	СтандартныеРеквизиты = Метаданные.Справочники[ИмяОбъектаМетаданных].СтандартныеРеквизиты;
	Для Каждого СтандартныйРеквизит Из СтандартныеРеквизиты Цикл 
		
		Если СтандартныйРеквизит.Имя = ИмяРеквизита Тогда 
			Если ЗначениеЗаполнено(СтандартныйРеквизит.Синоним) Тогда
				Представление = СтандартныйРеквизит.Синоним;
			Иначе //Если не заполнен или нет синонима
				Представление = СтандартныйРеквизит.Имя;
			КонецЕсли;
			
			Возврат Представление;
		КонецЕсли;
		
	КонецЦикла;
	
	Попытка
		
		Представление = Метаданные.Справочники[ИмяОбъектаМетаданных]["Реквизиты"][ИмяРеквизита].Синоним;
		
	Исключение
		
		Представление = "";
		
	КонецПопытки;
	
	
	Возврат Представление;
	
КонецФункции	

Функция ПолучитьНастройкуКонвертации(ТипСправочникаИлиДокументаУС, ТипСправочникаЛогистика, РеквизитТитула, ТолькоСОбновлениемРеквизитов = Ложь, ТолькоСРеквизитомТитула = Ложь) Экспорт 
	
	НастройкаКонвертации = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиКонвертацииСправочников.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиКонвертацииСправочников КАК КонтурЛогистика_НастройкиКонвертацииСправочников
	|ГДЕ
	|	НЕ КонтурЛогистика_НастройкиКонвертацииСправочников.ПометкаУдаления
	|	И (КонтурЛогистика_НастройкиКонвертацииСправочников.ТипСправочникаИлиДокументаУС = &ТипСправочникаИлиДокументаУС
	|			ИЛИ &ТипСправочникаИлиДокументаУС = НЕОПРЕДЕЛЕНО)
	|	И КонтурЛогистика_НастройкиКонвертацииСправочников.ТипСправочникаЛогистика = &ТипСправочникаЛогистика
	|	И (КонтурЛогистика_НастройкиКонвертацииСправочников.РеквизитТитула = &РеквизитТитула
	|			ИЛИ КонтурЛогистика_НастройкиКонвертацииСправочников.РеквизитТитула = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_РеквизитыТитуловДляНастроекКонвертацииСправочников.ПустаяСсылка))
	|	И &ОбновлятьРеквизитыИзУчетнойСистемы
	|
	|УПОРЯДОЧИТЬ ПО
	|	КонтурЛогистика_НастройкиКонвертацииСправочников.РеквизитТитула УБЫВ";
	
	Запрос.УстановитьПараметр("ТипСправочникаИлиДокументаУС", ТипСправочникаИлиДокументаУС);
	Запрос.УстановитьПараметр("ТипСправочникаЛогистика", ТипСправочникаЛогистика);
	
	ИмяПеречисления = ?(РеквизитТитула = "МестоВыгрузки", "МестоДоставки", РеквизитТитула);
	
	Если ЗначениеЗаполнено(ИмяПеречисления) Тогда
		Попытка
			ЗначениеПеречисленияРеквизитТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_РеквизитыТитуловДляНастроекКонвертацииСправочников." + ИмяПеречисления);
		Исключение
			ЗначениеПеречисленияРеквизитТитула = Неопределено;
		КонецПопытки;
	Иначе
		ЗначениеПеречисленияРеквизитТитула = Неопределено;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("РеквизитТитула", ЗначениеПеречисленияРеквизитТитула);

	Запрос.Текст = СтрЗаменить(Запрос.Текст, 
		"&ОбновлятьРеквизитыИзУчетнойСистемы", 
		?(ТолькоСОбновлениемРеквизитов, "КонтурЛогистика_НастройкиКонвертацииСправочников.ОбновлятьРеквизитыИзУчетнойСистемы", "ИСТИНА"));
		
	Если ТолькоСРеквизитомТитула Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, 
			"КонтурЛогистика_НастройкиКонвертацииСправочников.РеквизитТитула = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_РеквизитыТитуловДляНастроекКонвертацииСправочников.ПустаяСсылка)", 
			"Ложь");
	КонецЕсли;
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда  	
		
		НастройкаКонвертации = Выборка.Ссылка;
		
	КонецЕсли;	
	
	Возврат НастройкаКонвертации;
	
КонецФункции

Функция ПолучитьНастройкиКонвертацииСОбновлениемРеквизитов(ТипСправочникаИлиДокументаУС, ТипСправочникаЛогистика) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиКонвертацииСправочников.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиКонвертацииСправочников КАК КонтурЛогистика_НастройкиКонвертацииСправочников
	|ГДЕ
	|	НЕ КонтурЛогистика_НастройкиКонвертацииСправочников.ПометкаУдаления
	|	И КонтурЛогистика_НастройкиКонвертацииСправочников.ТипСправочникаИлиДокументаУС = &ТипСправочникаИлиДокументаУС
	|	И КонтурЛогистика_НастройкиКонвертацииСправочников.ТипСправочникаЛогистика = &ТипСправочникаЛогистика
	|	И КонтурЛогистика_НастройкиКонвертацииСправочников.ОбновлятьРеквизитыИзУчетнойСистемы";
	
	Запрос.УстановитьПараметр("ТипСправочникаИлиДокументаУС", ТипСправочникаИлиДокументаУС);
	Запрос.УстановитьПараметр("ТипСправочникаЛогистика", ТипСправочникаЛогистика);
				
	НастройкиКонвертации = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат НастройкиКонвертации;
	
КонецФункции

Функция УдалитьВсеНастройки() Экспорт 
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
	
		Выборка = Справочники.КонтурЛогистика_НастройкиКонвертацииСправочников.Выбрать();
		Пока Выборка.Следующий() Цикл 
			
			Если Не Выборка.ПометкаУдаления Тогда 
								
				НастройкаОбъект = Выборка.ПолучитьОбъект();
				НастройкаОбъект.УстановитьПометкуУдаления(Истина);
				
			КонецЕсли;	
			
		КонецЦикла;	
		
		Результат.Успешно = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		
		Результат.Успешно = Ложь;
		Результат.ОписаниеОшибки = "Не удалось удалить настройки конвертации справочников.";	
		
	КонецПопытки;

	Возврат Результат;
	
КонецФункции

#Область ЗаполнениеПравилКонвертации

Процедура ЗаполнитьПравилаКонвертации(ПравилаКонвертации, ТипСправочникаЛогистика, ТипСправочникаИлиДокументаУС, ТипДокументаОснования = Неопределено, РеквизитТитула = Неопределено) Экспорт 
		
	ПравилаКонвертации.Очистить();
	
	ОписанияРеквизитовСправочника = ПолучитьТаблицуОписанияРеквизитовСправочника(ТипСправочникаЛогистика);
		
	Для Каждого ОписаниеРеквизита Из ОписанияРеквизитовСправочника Цикл 
		
		ПравилоКонвертации = ПравилаКонвертации.Добавить();
		
		ПравилоКонвертации.РеквизитСправочникаЛогистика 				= ОписаниеРеквизита.Имя;
		ПравилоКонвертации.РеквизитСправочникаЛогистикаПредставление 	= ?(ЗначениеЗаполнено(ОписаниеРеквизита.Синоним), ОписаниеРеквизита.Синоним,
			ОписаниеРеквизита.Имя);

		Настройка = ПолучитьНастройкуДляПоля("РеквизитСправочникаЛогистика", ОписаниеРеквизита.Тип);			
						
		ЗаполнитьЗначенияСвойств(ПравилоКонвертации, Настройка);
		
		Если Не ЗначениеЗаполнено(ПравилоКонвертации.РеквизитСправочникаЛогистикаКомментарий) Тогда 
			
			ПравилоКонвертации.РеквизитСправочникаЛогистикаКомментарий 	= ОписаниеРеквизита.Комментарий;
			
		КонецЕсли;	
		
		Если Не ЗначениеЗаполнено(ПравилоКонвертации.Картинка) Тогда 
			
			ПравилоКонвертации.Картинка = 3;
			
		КонецЕсли;
		
	КонецЦикла;		
	
	ПравилаКонвертации.Сортировать("Картинка, РеквизитСправочникаЛогистикаПредставление");
	
КонецПроцедуры

Функция ПолучитьТаблицуОписанияРеквизитовСправочника(ИмяСправочника) Экспорт 
	
	ТаблицаОписаниеРеквизитов = Новый ТаблицаЗначений;
	
	ТаблицаОписаниеРеквизитов.Колонки.Добавить("Имя", 			КонтурЛогистика_ОбщегоНазначенияСервер.ОписаниеТипаСтрока(100));
	ТаблицаОписаниеРеквизитов.Колонки.Добавить("Синоним", 		КонтурЛогистика_ОбщегоНазначенияСервер.ОписаниеТипаСтрока(200));
	ТаблицаОписаниеРеквизитов.Колонки.Добавить("Комментарий", 	КонтурЛогистика_ОбщегоНазначенияСервер.ОписаниеТипаСтрока(1000));
	ТаблицаОписаниеРеквизитов.Колонки.Добавить("Тип", 			КонтурЛогистика_ОбщегоНазначенияСервер.ОписаниеТипаСтрока(200));
		
	Для Каждого ОписаниеРеквизита Из Метаданные.Справочники[ИмяСправочника].Реквизиты Цикл 
		
		ЗаполнитьЗначенияСвойств(ТаблицаОписаниеРеквизитов.Добавить(), ОписаниеРеквизита);
		
	КонецЦикла;
	
	Для Каждого ОписаниеРеквизита Из Метаданные.Справочники[ИмяСправочника].СтандартныеРеквизиты Цикл 
		
		Если ОписаниеРеквизита.Имя = "Код" 
			Или ОписаниеРеквизита.Имя = "Наименование"
			Или (ОписаниеРеквизита.Имя = "Владелец" 
				И ИмяСправочника = "КонтурЛогистика_Лицензии") Тогда 
			
			ЗаполнитьЗначенияСвойств(ТаблицаОписаниеРеквизитов.Добавить(), ОписаниеРеквизита);
						
		КонецЕсли;		
		
	КонецЦикла;
	
	ТаблицаОписаниеРеквизитов.Сортировать("Синоним");
	
	Возврат ТаблицаОписаниеРеквизитов;
	
КонецФункции

#КонецОбласти

#КонецЕсли
